"""
K近邻算法
    回归问题思路如下：
        给定训练集 D 和查询样本 x：
        1. 预处理：按训练集统计量对特征做缩放（KNN 对量纲敏感）。
        2. 计算距离：计算 x 到所有训练样本的距离 d(x,x_i)，暴力计算复杂度为 O(nd)。
        3. 选取近邻：按距离升序排序，取前 k 个；也可用堆、KD 树或 Ball 树加速。
        4. 等权回归 :  基于k个最近邻的均值
        5. 距离加权回归 : 基于k个最近邻的加权均值
    
    代码实现思路：
        1. 导包
        2. 准备数组集(测试集 和 训练集)
        3. 创建模型对象
        4. 模型训练
        5. 模型预测
        6. 模型评估
"""

# 导包
from sklearn.neighbors import KNeighborsRegressor

# 2. 准备数组集(测试集 和 训练集)
# 开根号：                   14.53    14.28     1       2.24      -- 取后三个y_train（0.2,0.3,0.4）的平均值：0.3
# 平方根：                   211      204       1        5
# 差值 ：                   (3,11,9) (2,10,10) (0,1,0)  (1,0,2)
x_train = [[0,0,1], [1,1,0], [3,10,10],[4,11,12]]  # 特征集, 每个样本两个特征
y_train = [0.1,0.2,0.3,0.4]     # 标签集

x_test = [[3,11,10]]  # 测试集
# 3. 创建模型对象
model = KNeighborsRegressor(n_neighbors=3)
# 4. 模型训练
model.fit(x_train, y_train)
# 5. 模型预测
y_test = model.predict(x_test)
print(f"预测值为：{y_test}")