"""
案例：演示特征预处理之 标准化操作

特征工程的目的 和 步骤
    目的：
        利用专业背景知识 和 技巧处理数据，用于提升模型的性能
    步骤：
        1.特征提取
        2.特征预处理
        3.特征降维
        4.特征选择
        5.特征组合

归一化：
    目的：
        防止因为 量纲(单位) 问题，导致特征列的方差值相差较大，影响模型的最终结果。将各列的值映射到 均值为0、标准差为1 的正态分布序列

    公式：
        x' = (当前值-该列平均值) / 该列的标准差

    应用场景：
        消除最大值和最小值等异常点的影响，所以它用于处理 大数据集。

结论：
    无论是归一化 还是 标准化，目的都是为了解决因为 量纲(单位) 问题，导致模型评估较低等问题。

方差计算公式：
    该列的每个值 和 该列的平均值 的差 的平方和 的均值
标准差计算公式：
    方差的开平方根

正太分布：是一种概率分布，大自然很多数据符合正态分布，也叫高斯分布，记作 N(μ，σ)
    μ 决定了其位置，标准差σ决定了分布的幅度
    当 μ=0, σ=1 时的正态分布是标准正态分布。
"""

# 导包
from sklearn.preprocessing import StandardScaler

# 准备数据集（标准化之前的数据）
x_train = [[90,2,10,40],[60,4,15,45],[75,3,13,46]]

# 创建标准化对象
scaler = StandardScaler()

# 对原始对象进行标准化
x_train_scaler = scaler.fit_transform(x_train)

print("标准化之后的数据据：\n", x_train_scaler)
print(f"数据集的均值：{scaler.mean_}")
print(f"数据集的方差：{scaler.var_}")
print(f"数据集的标准差：{scaler.scale_}")